app/controllers/artists_controller.rb

  def show
    @artist = Artist.find_by(id: params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]